# TextNoteOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions Constructor
TextNoteOptions Class See Also
---
Default constructor; populates the options with their respective default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public TextNoteOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TextNoteOptions()
```

# Remarks
The constructed options need to be given a typeId before it can be used to create a text note.
# See Also
TextNoteOptions Class
TextNoteOptions Overload
Autodesk.Revit.DB Namespace